app/controllers/admin/products_controller.rb

SELECT "products".* FROM "products" WHERE (name LIKE '%meme%' OR description LIKE '%meme%')
---
  def index
    @products = Product.all

INSERT INTO "products" ("name", "description", "price", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "Meme"], ["description", "Indian Meme"], ["price", 10.0], ["image", nil], ["created_at", "2024-08-19 23:27:15.820290"], ["updated_at", "2024-08-19 23:27:15.820290"]]
---
  def create
    @product = Product.new(product_params)

    if @product.save

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT ?  [["id", 14], ["LIMIT", 1]]
---
  def set_product
    @product = Product.find_by(id: params[:id])

SELECT "categories".* FROM "categories"
---
  def set_filters
    @categories = Category.all