app/views/admin/products/index.html.erb

SELECT "categories".* FROM "categories"
---
        <%= form.label :category, "Filter by Category:" %>
        <%= form.select :category, options_for_select(@categories.collect { |c| [c.name, c.id] }, params[:category]), { include_blank: 'All' }, { class: 'form-control' } %>

SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = ?  [["product_id", 2]]
---
                <h6 style="color: red;">Available Variants:</h6>
                <% product.variants.each do |variant| %>