app/views/admin/products/show.html.erb

SELECT "variants".* FROM "variants" WHERE "variants"."product_id" = ?  [["product_id", 2]]
---
            <tbody>
              <% @product.variants.each do |variant| %>