app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)
    puts product_params.inspect

    if @product.save
---
INSERT INTO "products" ("name", "description", "price", "image", "created_at", "updated_at", "color") VALUES (?, ?, ?, ?, ?, ?, ?) RETURNING "id"  [["name", "asdfg"], ["description", "asdfghj"], ["price", 90.0], ["image", nil], ["created_at", "2024-08-30 16:56:27.856734"], ["updated_at", "2024-08-30 16:56:27.856734"], ["color", nil]]